[A_MasterOfPrime_III_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力学识III"
mTooltip="%spell1.name 在下一战斗回合开始时在同一目标上重复施放，效果如同专家等级。\n用 %spell2.name 召唤的元素数量在下一战斗回合开始时增加4个。"

[A_Clarity_Buff H7BaseBuff]
mName="心领神会"
mTooltip=""

[A_PrimeScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力学者"
mTooltip="源力法术的法力消耗降低 %special.norm%。"

[A_ArcaneExaltation_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术强化"
mTooltip="%stat2 %stat2.icon 魔力\n%stat1 %stat1.icon 精神"

[A_ArcanePower_Ability H7HeroAbility]
mName="奥术能量"
mTooltip="英雄的魔力和精神提高1点。"
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="源力学识I"
mTooltip="时来运转和时间控制的目标为4x4区域内的所有生物。"
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="源力学识II"
mTooltip="强化移形换位：被传送的队伍获得+50主动性增益，直到其下一回合结束。驱魔大法的目标为3x3区域内的所有生物。"
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="源力学识III"
mTooltip="内向爆裂在下一战斗回合开始时对原目标再次生效，造成一半伤害。召唤元素在下一战斗回合开始时再次增加原召唤队伍数量的一半。"
[A_LingeringEnergy_Ability H7HeroAbility]
mName="魔力萦绕"
mTooltip="每场战斗后，英雄获得20点法力。这不能超过英雄的最大法力。"
[A_MagicRipple_Ability H7HeroAbility]
mName="魔法波纹"
mTooltip="内向爆裂法术在下一战斗回合开始时对同一目标再次生效，造成一半伤害。精神之门法术在下一战斗回合开始时再次增加先前召唤生物的一半。"
[A_ManaBloom_Ability H7HeroAbility]
mName="魔能绽放"
mTooltip="英雄每天恢复的法力翻倍。\n每天施放的第一个法术的法力会返还给英雄。"
[A_ManaBloom_Buff H7BaseBuff]
mName="魔能绽放"
[A_MassDispelMagic_Ability H7HeroAbility]
mName="群体驱魔"
mTooltip="驱魔大法的目标为4x4区域内的所有生物。"
[A_MassFortune_Ability H7HeroAbility]
mName="群体运势"
mTooltip="时来运转的目标为4x4区域内的所有友方生物。"
[A_MassTimeControl_Ability H7HeroAbility]
mName="群体控时"
mTooltip="时间控制的目标为4x4区域内的所有生物。"
[A_TimeJump_Ability H7HeroAbility]
mName="时光跳跃"
mTooltip="移形换位允许目标生物作为当前主动性队列中的第一个生物行动。如果被传送的生物已经行动过，它将被置于下一战斗回合主动性队列的开头。"

UCP 1.1

[A_MasterOfPrime_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力学识II"
mTooltip="%spell1.name 额外在 %spell1.spell.buff1.buff.durini 回合内提高目标生物的主动性 %spell1.spell.buff1.buff.stat.norm %spell1.spell.buff1.buff.stat.icon。\n%spell2.name 现在对目标3x3区域内的生物施放。"

UCP 1.2

[A_Renewal_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="苏生大法"
mTooltip="战斗后，英雄获得 %stat1.norm %stat1.icon 法力。"


v1.33


[A_MasterOfPrime_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="源力学识I"
mTooltip="%spell1.name 和 %spell2.name 现在对目标4x4区域内的生物施放。\n%spell3.name 现在治疗4x4区域。"

v1.37

[A_Clarity_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="心领神会"
mTooltip="英雄在战斗中施放一个源力法术后，他在此战斗回合获得第二次行动。在额外回合中施放的法术以 %buff.buff.stat2 %ICON_MAGIC 魔力施放。"

[A_PrimeMagic_Skill H7Skill]
mName="源力魔法"
mTooltip="允许你在魔法行会学习源力魔法学派的法术。改善并增强其效果。\n如果英雄拥有所需知识，则有几率学会一个新的4级源力法术。"
mDescriptions[0]="使源力法术更有效，并提高英雄的 %ICON_ARCANE_KNOWLEDGE 魔力。"
mDescriptions[1]=""
mDescriptions[2]="使源力法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力提高1点。\n英雄有几率学会一个新的1级源力法术。"
mDescriptions[3]="使源力法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高2点。\n如果英雄拥有所需知识，则有几率学会一个新的2级源力法术。"
mDescriptions[4]="使源力法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高3点。\n如果英雄拥有所需知识，则有几率学会一个新的3级源力法术。\n\n与大师级<font color="#00588BFF">战争</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：巴哈姆特召唤。"